---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionWrongType
source: html/814fe028-c8a4-1c79-536b-00c11f4c5d4b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionWrongType Property

Structural Connection has an inappropriate type assigned.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionWrongType { get; }
```